/**
 * DoubleSkillName.ts
 *
 * created by 2024/4/21
 * @file 双重流派技能名称接口
 * @author  Yiero
 * */

/** 双重流派技能名称接口 */
export type DoubleSkillName =
	'火环燃烧'
	| '火焰飞剑'

	| '燃烧火弹'
	| '爆燃火弹'
	| '雷云火弹'

	| '风暴火环'
	| '焚弹火环'

	| '地雷火焰'
	| '地雷闪光'

	| '火精灵引爆'
	| '火弹火精灵'
	| '火精灵弹跳'

	| '冰锥极寒'
	| '冰霜脉冲'

	| '寒冰毒雾'
	| '玄冰凝域'

	| '光枪冰锥'
	| '冰冻冰锥'
	| '冰爆锥体'

	| '无尽冰刺'
	| '冰刺再生'
	| '影子冰刺'
	| '雹云冰刺'

	| '冰雷云雾'
	| '冰落光阵'
	| '冰爆地雷'

	| '冰击化剑'
	| '冰剑刺击'
	| '光爆玄冰'

	| '闪电感电'
	| '脉冲电桩'
	| '黑洞脉冲'
	| '飞刃脉冲'

	| '电球闪电'
	| '触手闪电'

	| '光枪落雷'
	| '电球落雷'
	| '落雷惩戒'
	| '追踪落雷'

	| '电球发射'
	| '感电电球'
	| '影子电球'
	| '传导电桩'

	| '电桩链接'
	| '光阵电桩'

	| '电解化毒'
	| '剧毒史莱姆'
	| '毒液催化'

	| '分裂史莱姆'
	| '附身史莱姆'
	| '毒液史莱姆'

	| '中毒毒弹'
	| '分裂毒弹'
	| '河豚毒弹'

	| '毒液残留'
	| '地雷毒液'

	| '燃气毒泡'
	| '泡状毒液'
	
	| '暴躁触手'
	| '触手吞噬'
	| '影链牵引'

	| '影刃冲刺'
	| '概率影爆'
	| '冰影双剑'
	| '影刃回收'

	| '影子穿刺'
	| '影子转化'

	| '触手坍缩'
	| '黑洞减速'
	| '影刺吸附'
	| '活性黑洞'

	| '黑洞链接'
	| '影链电桩'

	| '落雷光枪'
	| '闪光光枪'

	| '火弹闪光'
	| '标记闪光'
	| '光枪闪光'
	| '影链致盲'

	| '光波传递'
	| '光波快充'
	| '光枪光波'

	| '光阵吸引'
	| '持久光阵'

	| '至圣标记'
	| '冰刺标记'
	| '标记光阵'

	| '嗜血飞剑'
	| '双向飞剑'

	| '针对影刺'
	| '撕裂光阵'
	| '斩杀风暴'

	| '召唤回旋刃'
	| '嗜血刃环'
	| '连续刃环'
	| '飞刃回环'

	| '嗜血风暴'
	| '黑洞刀刃'

	| '传送飞刃'
	| '落雷飞刃'